Revit 2027 API
BumpMap.BumpmapNormalScale Property
 The property labeled "Amount" from the "BumpMap" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string BumpmapNormalScale { get; }
Public Shared ReadOnly Property BumpmapNormalScale As String
	Get
public:
static property String^ BumpmapNormalScale {
	String^ get ();
}
static member BumpmapNormalScale : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyDouble".
See Also
Reference
BumpMap Class
Autodesk.Revit.DB.Visual Namespace